{
  "port2idx": {
    "AUSYD": 1,
    "CNCJK": 2,
    "ECGYL": 3,
    "CNJIJ": 4,
    "AUGEE": 5,
    "CNTAI": 6,
    "JPKII": 7,
    "NZAKL": 8,
    "ZADUR": 9,
    "GTPQL": 10,
    "AUGLE": 11,
    "MMMIO": 12,
    "CNTAX": 13,
    "CNZHE": 14,
    "CNZHH": 15,
    "IDCXP": 16,
    "KEMOM": 17,
    "MY3182": 18,
    "EGALE": 19,
    "BRRGR": 20,
    "AEJAL": 21,
    "OMMAF": 22,
    "CNDJK": 23,
    "TWKEE": 24,
    "BRATU": 25,
    "CNSHD": 26,
    "ESGIJ": 27,
    "CNDAF": 28,
    "VNSOD": 29,
    "CNLSN": 30,
    "QAASN": 31,
    "BRITA": 32,
    "MXLCS": 33,
    "CNTJN": 34,
    "AUBUN": 35,
    "CAVCR": 36,
    "CNZJG": 37,
    "GRTHE": 38,
    "CN8965": 39,
    "CNLYG": 40,
    "DEBRA": 41,
    "AUGER": 42,
    "CNTAZ": 43,
    "BRPDM": 44,
    "SAJED": 45,
    "CNYSN": 46,
    "ESSAN": 47,
    "KWMIB": 48,
    "BRIOA": 49,
    "XZCLV": 50,
    "CNXIA": 51,
    "AUPKE": 52,
    "USNPN": 53,
    "TWKAO": 54,
    "PLGDA": 55,
    "RUNJK": 56,
    "MYTPP": 57,
    "CNCHS": 58,
    "INMUN": 59,
    "ARARS": 60,
    "MACAS": 61,
    "BRPEC": 62,
    "GBFEL": 63,
    "AUWHY": 64,
    "NLEEM": 65,
    "CNRUG": 66,
    "SGSGP": 67,
    "ESHUE": 68,
    "CNSTO": 69,
    "CNPAN": 70,
    "ESBAR": 71,
    "XZKMN": 72,
    "CLSAN": 73,
    "IDJAK": 74,
    "NOBGN": 75,
    "THRAY": 76,
    "USVAN": 77,
    "CNLVS": 78,
    "GRAGT": 79,
    "PEMAT": 80,
    "HKHKG": 81,
    "MASAF": 82,
    "CNPLI": 83,
    "TRDER": 84,
    "FIHEL": 85,
    "CNDCB": 86,
    "CNWEF": 87,
    "GNBFF": 88,
    "CN9873": 89,
    "IDBAH": 90,
    "CAPCA": 91,
    "MYPAG": 92,
    "UYULA": 93,
    "TWMAI": 94,
    "GBSOU": 95,
    "CNFUZ": 96,
    "AUADE": 97,
    "USNFK": 98,
    "JPTOK": 99,
    "IDMUS": 100,
    "FIKOT": 101,
    "VNNGH": 102,
    "PHBAT": 103,
    "ESAVI": 104,
    "BRTUB": 105,
    "AESJH": 106,
    "ZAPLZ": 107,
    "FRLEH": 108,
    "AUCPN": 109,
    "CNHPU": 110,
    "JPSKI": 111,
    "DZDJE": 112,
    "CNYJG": 113,
    "PKKAR": 114,
    "VNHPG": 115,
    "KRKUN": 116,
    "AUDPR": 117,
    "USJAC": 118,
    "JPYOK": 119,
    "CNLKU": 120,
    "ITVEN": 121,
    "CNHUM": 122,
    "BRVIT": 123,
    "INKAK": 124,
    "AUBRI": 125,
    "MYPGG": 126,
    "CNJIN": 127,
    "GBLGP": 128,
    "CLANT": 129,
    "CNQHD": 130,
    "ECPBO": 131,
    "IDTBR": 132,
    "ITGOA": 133,
    "BRREC": 134,
    "INKNP": 135,
    "CNYPG": 136,
    "TRMMK": 137,
    "EGDAM": 138,
    "CANWE": 139,
    "LKCOL": 140,
    "CNMEZ": 141,
    "USLUA": 142,
    "AUAPT": 143,
    "PABAL": 144,
    "JPIWA": 145,
    "CNZOS": 146,
    "DJDJI": 147,
    "JPTOA": 148,
    "AUHAY": 149,
    "NLAMS": 150,
    "ITRAV": 151,
    "CNLAZ": 152,
    "UYFBS": 153,
    "CNQIZ": 154,
    "INCHN": 155,
    "KRPYT": 156,
    "DEHAM": 157,
    "CNBHI": 158,
    "CNSYA": 159,
    "JPMIZ": 160,
    "CNJIT": 161,
    "CNNBO": 162,
    "SIKOP": 163,
    "TRMER": 164,
    "JPKAW": 165,
    "CNHKO": 166,
    "GTSTC": 167,
    "AUPWA": 168,
    "ROCON": 169,
    "AUPHE": 170,
    "NLROT": 171,
    "BRMAC": 172,
    "USNYK": 173,
    "VNCMP": 174,
    "CNMWN": 175,
    "BEANT": 176,
    "CNQUA": 177,
    "CNNJG": 178,
    "CNBHX": 179,
    "JMKIN": 180,
    "INKAN": 181,
    "GBBEL": 182,
    "CNDNG": 183,
    "JPKMA": 184,
    "CNZHA": 185,
    "ESSAG": 186,
    "CN1087": 187,
    "TRHER": 188,
    "BRPAR": 189,
    "USSEA": 190,
    "AUFRE": 191,
    "CNFUN": 192,
    "USBEA": 193,
    "ZACPT": 194,
    "GHTEM": 195,
    "KRINC": 196,
    "MATAN": 197,
    "CNBYQ": 198,
    "CNBAS": 199,
    "AUTOW": 200,
    "PTLXS": 201,
    "GRELE": 202,
    "DEBHN": 203,
    "CNYZH": 204,
    "ESBIL": 205,
    "CNHUA": 206,
    "CNSIZ": 207,
    "SAJUT": 208,
    "USSAC": 209,
    "AUDEV": 210,
    "RUULG": 211,
    "VNPHU": 212,
    "INVIS": 213,
    "RUSPG": 214,
    "TWTAP": 215,
    "CNHYG": 216,
    "CNDDG": 217,
    "CNNTG": 218,
    "MYKUA": 219,
    "AEFUJ": 220,
    "TWHLN": 221,
    "JPKIS": 222,
    "JPCBA": 223,
    "CNHAA": 224,
    "EGPSA": 225,
    "MTMAL": 226,
    "INKUP": 227,
    "THLCB": 228,
    "IDSAM": 229,
    "CNGUA": 230,
    "CN9862": 231,
    "UACHO": 232,
    "BRSTS": 233,
    "RUNVS": 234,
    "KRGWA": 235,
    "CNYAN": 236,
    "CNNDE": 237,
    "ARROS": 238,
    "CNYIZ": 239,
    "DOSDO": 240,
    "SARTA": 241,
    "INNSA": 242,
    "ITGAE": 243,
    "CNBAO": 244,
    "ESCAR": 245,
    "MXESE": 246,
    "CNSDG": 247,
    "PESAL": 248,
    "FRBAY": 249,
    "TRGEB": 250,
    "CNDAL": 251,
    "USOAK": 252,
    "EGSKR": 253,
    "IDGRE": 254,
    "CNCZH": 255,
    "GNCON": 256,
    "UAODS": 257,
    "TRIST": 258,
    "CNDSN": 259,
    "USCHA": 260,
    "KWMAA": 261,
    "NZNAP": 262,
    "SAYAN": 263,
    "CNSWE": 264,
    "JPNAG": 265,
    "CLMEJ": 266,
    "JOAQA": 267,
    "VNHCM": 268,
    "COBUE": 269,
    "AEZUR": 270,
    "CN2039": 271,
    "CNCJN": 272,
    "CN9014": 273,
    "KRYOS": 274,
    "LTKLJ": 275,
    "CNFAN": 276,
    "AUBNE": 277,
    "UAYUZ": 278,
    "CIABI": 279,
    "JPHIB": 280,
    "BDCTG": 281,
    "ZASAB": 282,
    "QAHMD": 283,
    "CNRIZ": 284,
    "EGSOK": 285,
    "ARBNA": 286,
    "FRFEC": 287,
    "CLLIR": 288,
    "AUPLD": 289,
    "TRYAR": 290,
    "AEDAS": 291,
    "DORHA": 292,
    "CNCFD": 293,
    "IEDUB": 294,
    "FIRAU": 295,
    "COBAR": 296,
    "MXVER": 297,
    "BEZEE": 298,
    "USBNC": 299,
    "CNYTN": 300,
    "JPOSK": 301,
    "AERAK": 302,
    "CN2032": 303,
    "AEKHA": 304,
    "BRSAF": 305,
    "VNQUN": 306,
    "ITTAR": 307,
    "RUKZM": 308,
    "FRFOS": 309,
    "TRISK": 310,
    "CNSHE": 311,
    "THKSI": 312,
    "AUESP": 313,
    "JPKOB": 314,
    "TRALI": 315,
    "CNWEN": 316,
    "PTSBL": 317,
    "CAPRR": 318,
    "KRBUS": 319,
    "CNSLH": 320,
    "VNCAM": 321,
    "USSAV": 322,
    "ESTAR": 323,
    "JPOIT": 324,
    "CNNSA": 325,
    "TWTCH": 326,
    "NZLYT": 327,
    "OMSOH": 328,
    "AUMEL": 329,
    "ESVAL": 330,
    "TRKRS": 331,
    "KRDAN": 332,
    "SAJUB": 333,
    "BRIJI": 334,
    "MY3177": 335,
    "IQMAB": 336,
    "KRULS": 337,
    "FRDKK": 338,
    "MXMAN": 339,
    "IDKLR": 340,
    "TZDRS": 341,
    "CLARI": 342,
    "JPMOJ": 343,
    "CNQIN": 344,
    "USBTR": 345,
    "CNGLA": 346,
    "MY2243": 347,
    "CNWEI": 348,
    "MYTBS": 349,
    "CNPYU": 350,
    "AOPAZ": 351,
    "FRROU": 352,
    "IDSUR": 353,
    "CNCHZ": 354,
    "NZTAU": 355,
    "MYPEN": 356,
    "BRRDJ": 357,
    "PKQAS": 358,
    "MYPKE": 359,
    "CNDYI": 360,
    "CNZPU": 361,
    "AERUW": 362,
    "CNZZU": 363,
    "JPHHR": 364,
    "CLTAL": 365,
    "CNHUI": 366,
    "AUNTL": 367,
    "CNMJS": 368,
    "CNLYW": 369,
    "CNWGQ": 370,
    "USLGB": 371,
    "QARAS": 372,
    "CN9878": 373,
    "UYMON": 374,
    "KRMAS": 375,
    "AEABU": 376,
    "ZARIB": 377,
    "TRLMA": 378,
    "SADMA": 379,
    "JPFUK": 380,
    "CNSHA": 381,
    "KRPOH": 382,
    "CNSHS": 383,
    "BHBAH": 384,
    "USLSA": 385,
    "QAUMS": 386,
    "MXTUX": 387,
    "MY3173": 388,
    "LVRIX": 389,
    "RUVYP": 390,
    "CNCGM": 391,
    "NCNOA": 392,
    "CNJIA": 393,
    "GRPIR": 394,
    "PECAL": 395,
    "NLVSG": 396,
    "AUHBT": 397,
    "<unk>": 0
  },
  "ship2idx": {
    "OFFCNCYKK": 1,
    "OFFSSORKK": 2,
    "OACFGKKKK": 3,
    "OAOFORKKK": 4,
    "OAORCGKKK": 5,
    "OFFFRKRKK": 6,
    "OFFKFSNKK": 7,
    "OARKFFKKK": 8,
    "OFFNYNNKK": 9,
    "OFFAGCAKK": 10,
    "OACFARKKK": 11,
    "OFFRONYKK": 12,
    "OACSNYKKK": 13,
    "OFFGSGAKK": 14,
    "OARRFGRYK": 15,
    "OFFORNYKK": 16,
    "OACFOCKKK": 17,
    "OACNGFKKK": 18,
    "OFFGYSGKK": 19,
    "OFFAAONKK": 20,
    "OARCGANFK": 21,
    "OFFNNYFKK": 22,
    "OARRSGYCK": 23,
    "OAOFNNKKK": 24,
    "OFFARYAKK": 25,
    "OAOKNSKKK": 26,
    "OFFRASCKK": 27,
    "OARARGKKK": 28,
    "RFAFRFKKK": 29,
    "OARRGYKKK": 30,
    "RNFKCNKKK": 31,
    "OARNCGCRK": 32,
    "OFFCRRRKK": 33,
    "OAROYRNRK": 34,
    "OARCRRNSK": 35,
    "OARNCCKNK": 36,
    "OARFGKKKK": 37,
    "CRNKGSKRA": 38,
    "OFFSANNKK": 39,
    "OARARFKKK": 40,
    "OFFGYGFKK": 41,
    "OAOFARKKK": 42,
    "OAOFCCKKK": 43,
    "OAOAOGKKK": 44,
    "CRNKGFYRA": 45,
    "OARCGCOCK": 46,
    "OFFRKAAKK": 47,
    "OAOFGKKKK": 48,
    "OARCAYGRK": 49,
    "OARCROOOK": 50,
    "OARCROGOK": 51,
    "OAROFSCRK": 52,
    "OARARRKKK": 53,
    "RNOSFYKKK": 54,
    "OAOFFAKKK": 55,
    "OFFYGANKK": 56,
    "OARRSRCFK": 57,
    "OARACFKKK": 58,
    "OACNROKKK": 59,
    "OFFYNYRKK": 60,
    "OAOCCRKKK": 61,
    "OFFFGNYKK": 62,
    "OFFAGGNKK": 63,
    "OARCRRRNK": 64,
    "OFFFNYGKK": 65,
    "OFFOGRNKK": 66,
    "OACNCCGFK": 67,
    "OFFRAANKK": 68,
    "RFAKFSKKK": 69,
    "OARRRGKKK": 70,
    "OARASFKKK": 71,
    "OARRAKRAK": 72,
    "OFFNNCGKK": 73,
    "OFFRSYCKK": 74,
    "OFFYGFYKK": 75,
    "OARCGCORK": 76,
    "OACOGYKKK": 77,
    "OARNCOKAK": 78,
    "OFFFRYCKK": 79,
    "OFFFRGFKK": 80,
    "RFKKFAKKK": 81,
    "OAOARYKKK": 82,
    "OARAFSKKK": 83,
    "OFFGYGGKK": 84,
    "OAOFCKKKK": 85,
    "OAORCSKKK": 86,
    "OAROYCSNK": 87,
    "OFFKRKFKK": 88,
    "OACNFKKKK": 89,
    "NGRACONKK": 90,
    "OARAGFKKK": 91,
    "OARNCKCNK": 92,
    "OAOOFGKKK": 93,
    "OACKNGKKK": 94,
    "OARAFGKKK": 95,
    "OFFNYRGKK": 96,
    "OAOFOGKKK": 97,
    "OAOGRYKKK": 98,
    "OFFYOFFKK": 99,
    "OAOFOSKKK": 100,
    "OACRRAKKK": 101,
    "OARANFKKK": 102,
    "OACOFGOCK": 103,
    "OFFKNFFKK": 104,
    "OARRKCNAK": 105,
    "OARAYOKKK": 106,
    "OARYSNKKK": 107,
    "OARANAKKK": 108,
    "RNRKGGKKK": 109,
    "OFFRSFNKK": 110,
    "OAROONGSK": 111,
    "OFFGRCNKK": 112,
    "OARASKKKK": 113,
    "OAROYCONK": 114,
    "OFFNCFYKK": 115,
    "OARGGKKKK": 116,
    "OACRONKKK": 117,
    "OFFAGSYKK": 118,
    "OARCYRNNK": 119,
    "OFFASYRKK": 120,
    "OARYGGKKK": 121,
    "OACRKCSOK": 122,
    "OACROFKKK": 123,
    "OARSCSKKK": 124,
    "OFFKYYNKK": 125,
    "OFFYFNKKK": 126,
    "OFFKCAGKK": 127,
    "OAOFNSKKK": 128,
    "OAOFSGKKK": 129,
    "OFFANFOKK": 130,
    "OFFKAKCKK": 131,
    "OFFAKFCKK": 132,
    "OACNCRYCK": 133,
    "OACCSYKKK": 134,
    "OFFFNCRKK": 135,
    "OARFFKKKK": 136,
    "OFFGNCRKK": 137,
    "OACOFSFRK": 138,
    "OFFSANOKK": 139,
    "OAOKAFKKK": 140,
    "OFFYGRSKK": 141,
    "OFFAKSCKK": 142,
    "OACRNRKKK": 143,
    "OFFSNKOKK": 144,
    "OACAAYKKK": 145,
    "OARYRSKKK": 146,
    "OFFSNKRKK": 147,
    "OACACAKKK": 148,
    "OARNCRASK": 149,
    "OACOFRKKK": 150,
    "OARRKCKKK": 151,
    "OAROYNFGK": 152,
    "OARAOGKKK": 153,
    "OACNRRKKK": 154,
    "OFFANOFKK": 155,
    "OFFAOSSKK": 156,
    "OAOCARKKK": 157,
    "NGRKOGGKK": 158,
    "OARCRRNGK": 159,
    "OARYSRKKK": 160,
    "OACKCRKKK": 161,
    "OAOFNRKKK": 162,
    "OFFROFNKK": 163,
    "OARNCFYAK": 164,
    "OFFFFGNKK": 165,
    "OARAFKKKK": 166,
    "OFFFKSSKK": 167,
    "OFFNNCNKK": 168,
    "OFFOCRSKK": 169,
    "OARCGCRFK": 170,
    "OFFKCAYKK": 171,
    "OARCGAYNK": 172,
    "OFFCNCAKK": 173,
    "RNORNSKKK": 174,
    "OFFGSOAKK": 175,
    "OFFSNKCKK": 176,
    "OFFOGOYKK": 177,
    "OFFRAAGKK": 178,
    "OFFGRGSKK": 179,
    "OARASYKKK": 180,
    "OARNCCCCK": 181,
    "OARANOKKK": 182,
    "OARAARKKK": 183,
    "OARANCKKK": 184,
    "OFFCCYOKK": 185,
    "OACOASKKK": 186,
    "OFFRAYCKK": 187,
    "RNOGORKKK": 188,
    "OFFNCOYKK": 189,
    "RNCGRNKKK": 190,
    "OAOFKGKKK": 191,
    "OACGRRKKK": 192,
    "OFFGGOCKK": 193,
    "RNGNKRKKK": 194,
    "OARAYNKKK": 195,
    "OARAGAKKK": 196,
    "OAOROCKKK": 197,
    "OFFRYYCKK": 198,
    "OACOFFFNK": 199,
    "NGGAFNKKK": 200,
    "OFFASRYKK": 201,
    "OARGSFKKK": 202,
    "OFFAKKGKK": 203,
    "OARRRFKKK": 204,
    "NRSKKFNKA": 205,
    "OARARAKKK": 206,
    "OARCGCNSK": 207,
    "OFFSOSFKK": 208,
    "OAOFAGKKK": 209,
    "OACGNSKKK": 210,
    "OARCNFOSK": 211,
    "OFFKARCKK": 212,
    "OAOKFGKKK": 213,
    "OAOFAOKKK": 214,
    "OACNYYKKK": 215,
    "OARRKAKKK": 216,
    "OFFOGONKK": 217,
    "OFFCKCCKK": 218,
    "OARACRKKK": 219,
    "OFFCKASKK": 220,
    "NGNAKKKKK": 221,
    "NGOOCKKKK": 222,
    "OFFCSGCKK": 223,
    "OARFGAKKK": 224,
    "OAOFCSKKK": 225,
    "OARCGANOK": 226,
    "OFFANSFKK": 227,
    "OAONORKKK": 228,
    "OFFKFAYKK": 229,
    "OFFYCNGKK": 230,
    "OFFSOFNKK": 231,
    "OARAONKKK": 232,
    "OARKGSKKK": 233,
    "OARNCAACK": 234,
    "OAOKFYKKK": 235,
    "RFASOFKKK": 236,
    "OAOOSKKKK": 237,
    "OARAOSKKK": 238,
    "OAOKKYKKK": 239,
    "OFFKARRKK": 240,
    "OARNCRAYK": 241,
    "OARKGNKKK": 242,
    "OARCOFKKK": 243,
    "OARCROFCK": 244,
    "OARAYFKKK": 245,
    "RFCFYOKKK": 246,
    "CRNKGSKRC": 247,
    "OARNCCAAK": 248,
    "OARSNSKKK": 249,
    "OARNCFKSK": 250,
    "OARKGYKKK": 251,
    "OFFCAYYKK": 252,
    "OARAOAKKK": 253,
    "OFFKKAFKK": 254,
    "OARNCCRYK": 255,
    "OFFGAOGKK": 256,
    "OFFRAYRKK": 257,
    "OFFKYASKK": 258,
    "OFFYNKNKK": 259,
    "RNNOFOKKK": 260,
    "OFFAGSOKK": 261,
    "RNNSKSKKK": 262,
    "OAOFSOKKK": 263,
    "OFFKKCSKK": 264,
    "OARAOCKKK": 265,
    "OFFKNFOKK": 266,
    "OFFOARFKK": 267,
    "OAROSYYCK": 268,
    "OFFFARRKK": 269,
    "OAOFRRKKK": 270,
    "OAROCOKKK": 271,
    "OFFCGGSKK": 272,
    "NGRKCGCKK": 273,
    "OACCKSKRK": 274,
    "NGNAKAKKK": 275,
    "OACNNGKKK": 276,
    "OAOFROKKK": 277,
    "OARKNOKKK": 278,
    "OARGYCKKK": 279,
    "OARANKKKK": 280,
    "OFFGCOYKK": 281,
    "OFFCYROKK": 282,
    "OFFYGFFKK": 283,
    "OAOGFSKKK": 284,
    "OARCROOAK": 285,
    "OAOFKKKKK": 286,
    "RFCYROKKK": 287,
    "OAOKFFKKK": 288,
    "OARYGNKKK": 289,
    "OARFKCKRK": 290,
    "OARASSKKK": 291,
    "OFFCSGRKK": 292,
    "OARCKYFNK": 293,
    "OARAYSKKK": 294,
    "OARSYGKKK": 295,
    "OFFOOASKK": 296,
    "OARCRCOYK": 297,
    "OFFGCCFKK": 298,
    "OACONKKKK": 299,
    "OAOFFGKKK": 300,
    "OAOFKFKKK": 301,
    "OARCRAFAK": 302,
    "OARCGORSK": 303,
    "OARYFYKKK": 304,
    "OARYNGKKK": 305,
    "OFFFGGCKK": 306,
    "OFFAYOOKK": 307,
    "OARCYFGAK": 308,
    "OAONOYKKK": 309,
    "OFFARAGKK": 310,
    "OARCGANGK": 311,
    "OFFFKGGKK": 312,
    "OFFYANOKK": 313,
    "OFFKOROKK": 314,
    "OARRYGSOK": 315,
    "OFFAFFCKK": 316,
    "OARASCKKK": 317,
    "OAOKFKKKK": 318,
    "OFFGOSCKK": 319,
    "OARNCRCOK": 320,
    "OAOKKOKKK": 321,
    "OARANSKKK": 322,
    "OARNCGKNK": 323,
    "OFFOCFNKK": 324,
    "OARCSSAAK": 325,
    "OFFGOAGKK": 326,
    "OACROOKKK": 327,
    "OAOFCOKKK": 328,
    "OFFKORCKK": 329,
    "OFFGSARKK": 330,
    "OACOFSFCK": 331,
    "OFFSOGSKK": 332,
    "OARAGGKKK": 333,
    "OFFCAFSKK": 334,
    "OACCKGORK": 335,
    "OARCRRGNK": 336,
    "OFFYKCNKK": 337,
    "OARKNSKKK": 338,
    "OFFCRCSKK": 339,
    "OFFGYOFKK": 340,
    "OFFKNGOKK": 341,
    "OFFRKCYKK": 342,
    "OFFAFRCKK": 343,
    "OARKFCKKK": 344,
    "OARKNKKKK": 345,
    "OACGNOKKK": 346,
    "OAOFOCKKK": 347,
    "OFFGOAYKK": 348,
    "OFFAYOGKK": 349,
    "OFFKNFAKK": 350,
    "OFFYNYOKK": 351,
    "OFFRNACKK": 352,
    "OACKNNKKK": 353,
    "RNFGFCKKK": 354,
    "OAOAGGKKK": 355,
    "OFFKKOFKK": 356,
    "OAOFFYKKK": 357,
    "OAORONKKK": 358,
    "OFFYGFSKK": 359,
    "OARACAKKK": 360,
    "OAOFSKKKK": 361,
    "OAOFKYKKK": 362,
    "RFKASSKKK": 363,
    "OARNCRCAK": 364,
    "OAOFSRKKK": 365,
    "OACFAOKKK": 366,
    "OFFSONGKK": 367,
    "OACAOYKKK": 368,
    "OACACOKKK": 369,
    "OAOFCGKKK": 370,
    "OAORKOKKK": 371,
    "NGRKANRKK": 372,
    "OAROYASRK": 373,
    "OAOFCRKKK": 374,
    "RNRAORKKK": 375,
    "OFFOGROKK": 376,
    "OARYSYKKK": 377,
    "OAOOGAKKK": 378,
    "OARKFOKKK": 379,
    "OARNCRORK": 380,
    "OARKFRKKK": 381,
    "OFFCFGSKK": 382,
    "OFFGYGNKK": 383,
    "OFFSRNSKK": 384,
    "OARKFGKKK": 385,
    "OARSCFKKK": 386,
    "OFFGCARKK": 387,
    "OARYCGKKK": 388,
    "OFFOOACKK": 389,
    "OFFSNOYKK": 390,
    "OFFARGSKK": 391,
    "OARAYYKKK": 392,
    "OFFCARFKK": 393,
    "OAOFOOKKK": 394,
    "OARARCKKK": 395,
    "OFFKCFRKK": 396,
    "OARCRORSK": 397,
    "OARCKKKKK": 398,
    "OFFAKKAKK": 399,
    "OFFGRSSKK": 400,
    "OFFSRCCKK": 401,
    "OFFCFAOKK": 402,
    "OFFSNACKK": 403,
    "OFFGKSGKK": 404,
    "OARACCKKK": 405,
    "OARANGKKK": 406,
    "OARRSSSCK": 407,
    "OARKNFKKK": 408,
    "OARAOYKKK": 409,
    "OARAAYKKK": 410,
    "RFAYAAKKK": 411,
    "OARFGCKKK": 412,
    "OFFRKSAKK": 413,
    "OARROAYCK": 414,
    "OARCGANNK": 415,
    "OFFCFARKK": 416,
    "OFFFAGGKK": 417,
    "OARROYKRK": 418,
    "OFFCNCFKK": 419,
    "OAOAKAKKK": 420,
    "OFFCOCFKK": 421,
    "OARRKCKCK": 422,
    "OARRGKKKK": 423,
    "OFFRRRYKK": 424,
    "OARRCOKKK": 425,
    "OARARSKKK": 426,
    "RNFCKRKKK": 427,
    "OARNCRYSK": 428,
    "OFFFGOSKK": 429,
    "OAOGGNKKK": 430,
    "OACFNAKKK": 431,
    "OFFGNCAKK": 432,
    "OAOFKSKKK": 433,
    "OFFRNANKK": 434,
    "OARNCRYYK": 435,
    "OAOFANKKK": 436,
    "OARAYCKKK": 437,
    "OARCRRNFK": 438,
    "OARACKKKK": 439,
    "OAONNGKKK": 440,
    "OFFCOCSKK": 441,
    "OFFFFYFKK": 442,
    "OARSOSKKK": 443,
    "OFFKKOGKK": 444,
    "OFFFNCOKK": 445,
    "OFFCYRYKK": 446,
    "RFCCNAKKK": 447,
    "OACOFRKAK": 448,
    "OFFSNSSKK": 449,
    "OACAFGKKK": 450,
    "OFFCYRNKK": 451,
    "OFFCAYSKK": 452,
    "OAOCFGKKK": 453,
    "OAROYOYOK": 454,
    "OFFFACOKK": 455,
    "OFFYGRCKK": 456,
    "OFFKSYRKK": 457,
    "OACYKKKKK": 458,
    "OFFRGKSKK": 459,
    "OFFGOSGKK": 460,
    "GRGKCKFNY": 461,
    "RNGKFFKKK": 462,
    "OFFAASGKK": 463,
    "OFFFRKAKK": 464,
    "OAOANCKKK": 465,
    "OARCGAOFK": 466,
    "OAROFAKNK": 467,
    "OFFKCFNKK": 468,
    "OARAAAKKK": 469,
    "OAORKRKKK": 470,
    "OAORGKKKK": 471,
    "OARAFYKKK": 472,
    "OFFARYYKK": 473,
    "OARAOOKKK": 474,
    "OARRRRYRK": 475,
    "CRNKGSKCY": 476,
    "OARRGSKKK": 477,
    "OAROYOFAK": 478,
    "OFFKAGRKK": 479,
    "OFFYKCAKK": 480,
    "OARCRCOFK": 481,
    "OFFNYSOKK": 482,
    "OFFAYGRKK": 483,
    "OFFCNFAKK": 484,
    "OFFYOFRKK": 485,
    "OFFGAFSKK": 486,
    "OARCYGNRK": 487,
    "OFFSNGCKK": 488,
    "RNAFKKKKK": 489,
    "OARNCRCRK": 490,
    "OARCROORK": 491,
    "OAOFCAKKK": 492,
    "CRNKGSKCN": 493,
    "OFFGNCYKK": 494,
    "OARNCNGRK": 495,
    "OFFFAFAKK": 496,
    "GRGKANAAK": 497,
    "OARGSGKKK": 498,
    "OARRSSOYK": 499,
    "RNOFYFKKK": 500,
    "OACRORKKK": 501,
    "OARAKSKKK": 502,
    "OFFANFSKK": 503,
    "OFFGNNOKK": 504,
    "OARCGANSK": 505,
    "OARASRKKK": 506,
    "OARNCKCGK": 507,
    "OARRFGKKK": 508,
    "OAOAFOKKK": 509,
    "OARCRRCOK": 510,
    "OAOOSYKKK": 511,
    "OFFASRSKK": 512,
    "OARCRCSYK": 513,
    "OARANYKKK": 514,
    "OFFFACSKK": 515,
    "OACACKKKK": 516,
    "OARCRRRFK": 517,
    "RNRGYRKKK": 518,
    "OFFNOAFKK": 519,
    "OFFKSFSKK": 520,
    "RNOORRKKK": 521,
    "OFFKFFSKK": 522,
    "OFFSANRKK": 523,
    "OAOFCNKKK": 524,
    "OFFRYFYKK": 525,
    "OACFGNKKK": 526,
    "OFFGGNAKK": 527,
    "OARACYKKK": 528,
    "OACCSSKKK": 529,
    "OARCROGGK": 530,
    "OACNCRSYK": 531,
    "OARAROKKK": 532,
    "OAOFASKKK": 533,
    "OARAFRKKK": 534,
    "NGRKGAFKK": 535,
    "OFFAYOAKK": 536,
    "NGRAASOKK": 537,
    "OARAFCKKK": 538,
    "OARASNKKK": 539,
    "OARCRCSGK": 540,
    "OAOAONKKK": 541,
    "OAOFSCKKK": 542,
    "CRNKGSKNA": 543,
    "OARCRRGCK": 544,
    "OFFKCRAKK": 545,
    "OFFAOSFKK": 546,
    "OAOFKAKKK": 547,
    "OAOANGKKK": 548,
    "OARAFAKKK": 549,
    "OFFCNFCKK": 550,
    "OFFCCCAKK": 551,
    "RFCCCOKKK": 552,
    "OFFGGNFKK": 553,
    "OAOFCYKKK": 554,
    "OARROSOSK": 555,
    "OARARKKKK": 556,
    "OAOCGKKKK": 557,
    "GRGKCAKFG": 558,
    "OAOACRKKK": 559,
    "OARAGYKKK": 560,
    "OAOFSFKKK": 561,
    "OARCAYKYK": 562,
    "OFFKCFOKK": 563,
    "OARCGSNFK": 564,
    "RNOOKNKKK": 565,
    "OAOCFCKKK": 566,
    "OACROYKKK": 567,
    "OFFRSFRKK": 568,
    "OARRKCKYK": 569,
    "OARKKRKKK": 570,
    "OACKROKKK": 571,
    "OARCRCOSK": 572,
    "OAONSSKKK": 573,
    "OFFFGNSKK": 574,
    "OFFGRFSKK": 575,
    "OARACSKKK": 576,
    "OACAYYKKK": 577,
    "OARRKCNCK": 578,
    "RNGNKCKKK": 579,
    "OARAANKKK": 580,
    "OAOFOKKKK": 581,
    "OARANRKKK": 582,
    "OAOFSNKKK": 583,
    "OAOFCFKKK": 584,
    "OFFFCAOKK": 585,
    "OAOFFSKKK": 586,
    "OARCRRGOK": 587,
    "OFFSOGNKK": 588,
    "OAOFAYKKK": 589,
    "RNRCOAKKK": 590,
    "OARCYNYGK": 591,
    "OARRSASRK": 592,
    "OFFNNKRKK": 593,
    "OARRFYAFK": 594,
    "OAROFAYFK": 595,
    "OARACNKKK": 596,
    "OAOCNSKKK": 597,
    "OAROFYAAK": 598,
    "OAOFFOKKK": 599,
    "OFFAOCAKK": 600,
    "OAOFKCKKK": 601,
    "OAROYKOAK": 602,
    "OARAFFKKK": 603,
    "OARCRRNYK": 604,
    "OARCRSANK": 605,
    "CRNKGFYSF": 606,
    "OAROYRKSK": 607,
    "OAOFRCKKK": 608,
    "OAOOGOKKK": 609,
    "OFFSNOSKK": 610,
    "NGRKCCCKK": 611,
    "OARCSFCFK": 612,
    "OAOAACKKK": 613,
    "OACKRCKKK": 614,
    "OARCRAROK": 615,
    "OACCRFKKK": 616,
    "OAONAKKKK": 617,
    "OFFARFSKK": 618,
    "OFFSRRRKK": 619,
    "OAOFFRKKK": 620,
    "OACROGKKK": 621,
    "OARCGARSK": 622,
    "OARCYGKFK": 623,
    "OACNCCCSK": 624,
    "OACNCRYAK": 625,
    "OARAYAKKK": 626,
    "OARCROOCK": 627,
    "OFFKNKYKK": 628,
    "OACOFAKKK": 629,
    "OFFGYGYKK": 630,
    "OAOFKNKKK": 631,
    "OFFAKNFKK": 632,
    "OARCFNYRK": 633,
    "OFFAAFOKK": 634,
    "OAOFRAKKK": 635,
    "OAOGAAKKK": 636,
    "OFFFGFRKK": 637,
    "OFFOFGSKK": 638,
    "OARKGKKKK": 639,
    "OAOCANKKK": 640,
    "OAOKFRKKK": 641,
    "OARNFYKKK": 642,
    "OARCGANRK": 643,
    "OARKNYKKK": 644,
    "OFFKNKOKK": 645,
    "OFFFGSAKK": 646,
    "OFFCSCYKK": 647,
    "OFFYCNOKK": 648,
    "OAROFSCOK": 649,
    "OARCFYGGK": 650,
    "OFFSAAGKK": 651,
    "OARYSOKKK": 652,
    "OFFAAFYKK": 653,
    "OFFGRYSKK": 654,
    "RNOSSGKKK": 655,
    "OACOFFFOK": 656,
    "OARYFGKKK": 657,
    "OAOOYKKKK": 658,
    "OARSSKKKK": 659,
    "OAOCAOKKK": 660,
    "OFFYOFGKK": 661,
    "OAROFAYGK": 662,
    "OFFKCRCKK": 663,
    "OFFCOCYKK": 664,
    "OACKGYKKK": 665,
    "OAOOYNKKK": 666,
    "OACRYSKKK": 667,
    "OARAGKKKK": 668,
    "OAOFKRKKK": 669,
    "OARARNKKK": 670,
    "OARAOFKKK": 671,
    "OAOFNKKKK": 672,
    "OAOFNAKKK": 673,
    "OARNCCOSK": 674,
    "OAOAGSKKK": 675,
    "OARCGARNK": 676,
    "OAOOOSKKK": 677,
    "OAOKACKKK": 678,
    "OAOAFYKKK": 679,
    "OFFRKAOKK": 680,
    "OARRRKKKK": 681,
    "OARFGRKKK": 682,
    "OARCFGKFK": 683,
    "OARCYOSNK": 684,
    "OARAOKKKK": 685,
    "OAOFOAKKK": 686,
    "OFFCGYOKK": 687,
    "NGRAFFRKK": 688,
    "OACKGSKKK": 689,
    "OFFSRGAKK": 690,
    "OFFRSFOKK": 691,
    "OFFASNNKK": 692,
    "OAOFSYKKK": 693,
    "OFFOCOYKK": 694,
    "OARCGAROK": 695,
    "GRGKAYRNC": 696,
    "OARCAKKNK": 697,
    "OFFFKGOKK": 698,
    "OFFFYRGKK": 699,
    "OFFFKSFKK": 700,
    "RNCFFRKKK": 701,
    "OFFFAGFKK": 702,
    "OARCAYNYK": 703,
    "OARCRRRSK": 704,
    "OARFRGKKK": 705,
    "OFFFOGAKK": 706,
    "OARCOSKKK": 707,
    "OARASAKKK": 708,
    "RNNSYYKKK": 709,
    "OAROFAYNK": 710,
    "RNCGRAKKK": 711,
    "OAOFFFKKK": 712,
    "OFFOGOOKK": 713,
    "OAOCKSKKK": 714,
    "OARRSYFCK": 715,
    "OFFSAKFKK": 716,
    "OFFCAROKK": 717,
    "OAROYAASK": 718,
    "OARCRRGRK": 719,
    "OACROSKKK": 720,
    "OARCGKNRK": 721,
    "OFFOCOGKK": 722,
    "OACYNKKKK": 723,
    "OFFCFOOKK": 724,
    "RFAAACKKK": 725,
    "OARROYGNK": 726,
    "OACFOGKKK": 727,
    "OFFROKOKK": 728,
    "OFFKFFFKK": 729,
    "OFFAFORKK": 730,
    "OARAGCKKK": 731,
    "OARNCGKGK": 732,
    "GRGKAGYYK": 733,
    "OARCNYFSK": 734,
    "OACKRNKKK": 735,
    "OARCRAKRK": 736,
    "OACCGKKKK": 737,
    "OARASOKKK": 738,
    "RNOYKSKKK": 739,
    "OARSYRKKK": 740,
    "OAOFRGKKK": 741,
    "RNASGFKKK": 742,
    "OFFAGGGKK": 743,
    "OAROFYYFK": 744,
    "OAOAFNKKK": 745,
    "OACRFSFOK": 746,
    "OFFYARAKK": 747,
    "OFFCRCCKK": 748,
    "OAROYRNOK": 749,
    "OFFGRGAKK": 750,
    "OAOFACKKK": 751,
    "OFFRSFFKK": 752,
    "RNRSKAKKK": 753,
    "OFFAYCCKK": 754,
    "OARRKCKSK": 755,
    "OFFNYNYKK": 756,
    "OARNCRCCK": 757,
    "OFFAFCFKK": 758,
    "NGRKCRGKK": 759,
    "OAOAYYKKK": 760,
    "OAOOFOKKK": 761,
    "OARAGNKKK": 762,
    "OACKSOKKK": 763,
    "OFFAYOSKK": 764,
    "OFFARNSKK": 765,
    "OFFYKCGKK": 766,
    "OARNCFYSK": 767,
    "OARCAYGAK": 768,
    "OFFGRFGKK": 769,
    "OARKGRKKK": 770,
    "NGRKASOKK": 771,
    "OARCRORYK": 772,
    "OARRRYKKK": 773,
    "OACFFNKKK": 774,
    "NGRARNOKK": 775,
    "NGRARORKK": 776,
    "RNGFYAKKK": 777,
    "OFFFFGCKK": 778,
    "OFFFCCCKK": 779,
    "OARKNRKKK": 780,
    "OFFGRKRKK": 781,
    "OARCGARFK": 782,
    "OACKYAKKK": 783,
    "RFKARSKKK": 784,
    "OACFKGKKK": 785,
    "OARKGOKKK": 786,
    "OACGKOKKK": 787,
    "OFFCRROKK": 788,
    "OARYFNKKK": 789,
    "RNCONGKKK": 790,
    "OARKNNKKK": 791,
    "OFFCGYRKK": 792,
    "OARSRFKKK": 793,
    "OARRYSOOK": 794,
    "GRGKCKFYK": 795,
    "OAOFFNKKK": 796,
    "OAOONNKKK": 797,
    "OARSYKKKK": 798,
    "OARAYGKKK": 799,
    "OFFSNKGKK": 800,
    "OAOFFCKKK": 801,
    "OAORNKKKK": 802,
    "RFAGCKKKK": 803,
    "OFFGNCCKK": 804,
    "OFFAKRAKK": 805,
    "OFFGCSRKK": 806,
    "OARKFSKKK": 807,
    "OFFAKKRKK": 808,
    "OACFNKKKK": 809,
    "OARCYRCOK": 810,
    "OARNORKKK": 811,
    "OFFSRCRKK": 812,
    "OFFAKKCKK": 813,
    "OAORAKKKK": 814,
    "OFFGANFKK": 815,
    "OFFAGCNKK": 816,
    "OACFGSKKK": 817,
    "OARAASKKK": 818,
    "OARCRRRGK": 819,
    "OAOFNCKKK": 820,
    "OARASGKKK": 821,
    "RNGNSAKKK": 822,
    "RNGFGKKKK": 823,
    "OARNCFGGK": 824,
    "RNCANRKKK": 825,
    "<unk>": 0
  },
  "ship_to_valid_ports": {
    "OFFCNCYKK": [
      "CNHUA",
      "CNCJK",
      "TRYAR",
      "JPYOK",
      "CNCFD",
      "CNTAI",
      "BEZEE",
      "AUGLE",
      "CNLKU",
      "CNYTN",
      "CNZHE",
      "RUULG",
      "KEMOM",
      "AUBRI",
      "MYPGG",
      "FRFOS",
      "MY3182",
      "CNJIN",
      "TWTAP",
      "EGALE",
      "BRRGR",
      "AEJAL",
      "CNDDG",
      "CNSHE",
      "THKSI",
      "AUESP",
      "CNDJK",
      "AEFUJ",
      "ITGOA",
      "TRALI",
      "JPKIS",
      "JPCBA",
      "ESGIJ",
      "CNYPG",
      "EGPSA",
      "MTMAL",
      "KRBUS",
      "EGDAM",
      "CNSLH",
      "VNCAM",
      "CNLSN",
      "THLCB",
      "CNGUA",
      "BRITA",
      "USSAV",
      "MXLCS",
      "CNTJN",
      "CNMEZ",
      "BRSTS",
      "CNNSA",
      "JPOIT",
      "KRGWA",
      "CAVCR",
      "OMSOH",
      "PABAL",
      "CNYAN",
      "CNZJG",
      "CNLYG",
      "KRDAN",
      "SAJUB",
      "BRPDM",
      "MY3177",
      "CNZOS",
      "SAJED",
      "CNYSN",
      "AUHAY",
      "NLAMS",
      "KRULS",
      "MXMAN",
      "CNQIN",
      "CNXIA",
      "CNBAO",
      "ESCAR",
      "PLGDA",
      "TWKAO",
      "CNLAZ",
      "RUNJK",
      "CNGLA",
      "INMUN",
      "CNQIZ",
      "CNSDG",
      "MY2243",
      "KRPYT",
      "DEHAM",
      "MYTBS",
      "JPMIZ",
      "SGSGP",
      "CNJIT",
      "CNNBO",
      "SIKOP",
      "TRMER",
      "JPKAW",
      "CNPAN",
      "ESBAR",
      "BRRDJ",
      "USOAK",
      "CNDAL",
      "CLSAN",
      "ROCON",
      "NLROT",
      "MYPKE",
      "UAODS",
      "GRAGT",
      "AERUW",
      "CLTAL",
      "USNYK",
      "HKHKG",
      "CNHUI",
      "AUNTL",
      "CNDSN",
      "CNMJS",
      "CNMWN",
      "BEANT",
      "USCHA",
      "KWMAA",
      "CNLYW",
      "SAYAN",
      "CNWGQ",
      "QARAS",
      "JPNAG",
      "MYPAG",
      "UYULA",
      "TWMAI",
      "GBSOU",
      "UYMON",
      "JOAQA",
      "COBUE",
      "JPKMA",
      "AEABU",
      "CNZHA",
      "CN2039",
      "SADMA",
      "BRPAR",
      "JPFUK",
      "KRYOS",
      "USSEA",
      "CNFAN",
      "BRTUB",
      "CNFUN",
      "KRPOH",
      "ZACPT",
      "BHBAH",
      "FRLEH",
      "USLSA",
      "KRINC",
      "QAUMS",
      "CNBYQ",
      "JPSKI",
      "CNRIZ",
      "CNCGM",
      "PKKAR",
      "VNHPG",
      "CNJIA",
      "GRELE",
      "ARBNA",
      "PECAL",
      "CNYZH"
    ],
    "OFFSSORKK": [
      "CNQIZ",
      "CNSLH",
      "CNLSN",
      "CNSDG",
      "QAASN",
      "SAJUT",
      "CNCFD",
      "AEZUR",
      "CNZHA",
      "JPKII",
      "SGSGP",
      "CNTJN",
      "CNNBO",
      "CNMEZ",
      "MMMIO",
      "KRGWA",
      "CNYAN",
      "CNDAL",
      "XZKMN",
      "CNJIN",
      "OMMAF",
      "BRPDM",
      "AERUW",
      "CNZOS",
      "IQMAB",
      "CNDJK",
      "CNHUI",
      "JPSKI",
      "SARTA",
      "AEFUJ",
      "KWMAA",
      "JPCBA",
      "CNQIN",
      "CNYPG",
      "TWKAO"
    ],
    "OACFGKKKK": [
      "CNHUA",
      "CNCJK",
      "TRYAR",
      "ECGYL",
      "CNJIJ",
      "JPYOK",
      "CNCFD",
      "CNTAI",
      "BEZEE",
      "AUGLE",
      "CNLKU",
      "CNYTN",
      "JPOSK",
      "CNZHE",
      "KEMOM",
      "AUBRI",
      "CNJIN",
      "TWTAP",
      "EGALE",
      "BRRGR",
      "AEJAL",
      "CNDDG",
      "CNNTG",
      "CNSHE",
      "AUESP",
      "CNDJK",
      "AEFUJ",
      "CNQHD",
      "ITGOA",
      "JPKIS",
      "INKNP",
      "CNWEN",
      "ESGIJ",
      "CNYPG",
      "MTMAL",
      "KRBUS",
      "VNCAM",
      "CNLSN",
      "THLCB",
      "IDSAM",
      "CNGUA",
      "MXLCS",
      "CNTJN",
      "CNMEZ",
      "BRSTS",
      "CNNSA",
      "JPOIT",
      "KRGWA",
      "CAVCR",
      "OMSOH",
      "CNYAN",
      "AUMEL",
      "CNZJG",
      "CNLYG",
      "KRDAN",
      "AUGER",
      "CNTAZ",
      "SAJUB",
      "CNZOS",
      "SAJED",
      "CNYSN",
      "NLAMS",
      "KRULS",
      "MXMAN",
      "CNQIN",
      "CNXIA",
      "CNBAO",
      "ESCAR",
      "PLGDA",
      "TWKAO",
      "CNLAZ",
      "CNCHS",
      "CNGLA",
      "INMUN",
      "CNQIZ",
      "CNSDG",
      "BRPEC",
      "KRPYT",
      "DEHAM",
      "CNBHI",
      "CNWEI",
      "JPMIZ",
      "CNRUG",
      "SGSGP",
      "CNJIT",
      "CNNBO",
      "SIKOP",
      "CNCHZ",
      "CNSTO",
      "CNPAN",
      "BRRDJ",
      "USOAK",
      "CNDAL",
      "ROCON",
      "PKQAS",
      "NLROT",
      "MYPKE",
      "GRAGT",
      "CNZZU",
      "USNYK",
      "HKHKG",
      "CNPLI",
      "CNHUI",
      "AUNTL",
      "CNDSN",
      "CNDCB",
      "BEANT",
      "KWMAA",
      "SAYAN",
      "CNWGQ",
      "CNQUA",
      "IDBAH",
      "CNNJG",
      "JPNAG",
      "MYPAG",
      "UYULA",
      "TWMAI",
      "GBSOU",
      "UYMON",
      "JOAQA",
      "AUADE",
      "COBUE",
      "JPKMA",
      "AEABU",
      "CNZHA",
      "ZARIB",
      "SADMA",
      "BRPAR",
      "JPFUK",
      "CNFAN",
      "AUFRE",
      "BRTUB",
      "CNFUN",
      "KRPOH",
      "BHBAH",
      "FRLEH",
      "USLSA",
      "KRINC",
      "QAUMS",
      "CNBYQ",
      "JPSKI",
      "CNRIZ",
      "CNCGM",
      "PKKAR",
      "VNHPG",
      "CNJIA",
      "PECAL",
      "CNYZH"
    ],
    "OAOFORKKK": [
      "CNHUA",
      "CNCJK",
      "TRYAR",
      "ECGYL",
      "CNJIJ",
      "JPYOK",
      "CNCFD",
      "CNTAI",
      "BEZEE",
      "AUGLE",
      "CNLKU",
      "CNYTN",
      "JPOSK",
      "CNZHE",
      "KEMOM",
      "AUBRI",
      "CNJIN",
      "TWTAP",
      "EGALE",
      "BRRGR",
      "AEJAL",
      "CNDDG",
      "CNNTG",
      "CNSHE",
      "AUESP",
      "CNDJK",
      "AEFUJ",
      "CNQHD",
      "ITGOA",
      "JPKIS",
      "INKNP",
      "CNWEN",
      "ESGIJ",
      "CNYPG",
      "MTMAL",
      "KRBUS",
      "VNCAM",
      "CNLSN",
      "THLCB",
      "IDSAM",
      "CNGUA",
      "MXLCS",
      "CNTJN",
      "CNMEZ",
      "BRSTS",
      "CNNSA",
      "JPOIT",
      "KRGWA",
      "CAVCR",
      "OMSOH",
      "CNYAN",
      "AUMEL",
      "CNZJG",
      "CNLYG",
      "KRDAN",
      "AUGER",
      "CNTAZ",
      "SAJUB",
      "CNZOS",
      "SAJED",
      "CNYSN",
      "NLAMS",
      "KRULS",
      "MXMAN",
      "CNQIN",
      "CNXIA",
      "CNBAO",
      "ESCAR",
      "PLGDA",
      "TWKAO",
      "CNLAZ",
      "CNCHS",
      "CNGLA",
      "INMUN",
      "CNQIZ",
      "CNSDG",
      "BRPEC",
      "KRPYT",
      "DEHAM",
      "CNBHI",
      "CNWEI",
      "JPMIZ",
      "CNRUG",
      "SGSGP",
      "CNJIT",
      "CNNBO",
      "SIKOP",
      "CNCHZ",
      "CNSTO",
      "CNPAN",
      "BRRDJ",
      "USOAK",
      "CNDAL",
      "ROCON",
      "PKQAS",
      "NLROT",
      "MYPKE",
      "GRAGT",
      "CNZZU",
      "USNYK",
      "HKHKG",
      "CNPLI",
      "CNHUI",
      "AUNTL",
      "CNDSN",
      "CNDCB",
      "BEANT",
      "KWMAA",
      "SAYAN",
      "CNWGQ",
      "CNQUA",
      "IDBAH",
      "CNNJG",
      "JPNAG",
      "MYPAG",
      "UYULA",
      "TWMAI",
      "GBSOU",
      "UYMON",
      "JOAQA",
      "AUADE",
      "COBUE",
      "JPKMA",
      "AEABU",
      "CNZHA",
      "ZARIB",
      "SADMA",
      "BRPAR",
      "JPFUK",
      "CNFAN",
      "AUFRE",
      "BRTUB",
      "CNFUN",
      "KRPOH",
      "BHBAH",
      "FRLEH",
      "USLSA",
      "KRINC",
      "QAUMS",
      "CNBYQ",
      "JPSKI",
      "CNRIZ",
      "CNCGM",
      "PKKAR",
      "VNHPG",
      "CNJIA",
      "PECAL",
      "CNYZH"
    ],
    "OAORCGKKK": [
      "CNHUA",
      "AUSYD",
      "CNCJK",
      "TRYAR",
      "JPYOK",
      "CNCFD",
      "CNTAI",
      "BEZEE",
      "AUGLE",
      "CNLKU",
      "CNYTN",
      "CNZHE",
      "RUULG",
      "KEMOM",
      "AUBRI",
      "MYPGG",
      "MY3182",
      "CNJIN",
      "TWTAP",
      "EGALE",
      "BRRGR",
      "AEJAL",
      "CNDDG",
      "CNSHE",
      "THKSI",
      "AUESP",
      "CNDJK",
      "AEFUJ",
      "ITGOA",
      "TRALI",
      "JPKIS",
      "JPCBA",
      "CNWEN",
      "ESGIJ",
      "CNYPG",
      "EGPSA",
      "VNSOD",
      "MTMAL",
      "KRBUS",
      "EGDAM",
      "CNSLH",
      "VNCAM",
      "CNLSN",
      "THLCB",
      "IDSAM",
      "CNGUA",
      "BRITA",
      "USSAV",
      "MXLCS",
      "CNTJN",
      "CNMEZ",
      "BRSTS",
      "CNNSA",
      "JPOIT",
      "KRGWA",
      "CAVCR",
      "OMSOH",
      "PABAL",
      "CNYAN",
      "CNZJG",
      "CNLYG",
      "KRDAN",
      "AUGER",
      "SAJUB",
      "BRPDM",
      "CNZOS",
      "SAJED",
      "CNYSN",
      "JPTOA",
      "AUHAY",
      "NLAMS",
      "KRULS",
      "MXMAN",
      "CNQIN",
      "CNXIA",
      "USNPN",
      "ESCAR",
      "PLGDA",
      "TWKAO",
      "MYTPP",
      "CNBAO",
      "RUNJK",
      "CNGLA",
      "INMUN",
      "CNQIZ",
      "CNSDG",
      "MY2243",
      "BRPEC",
      "KRPYT",
      "DEHAM",
      "CNWEI",
      "MYTBS",
      "JPMIZ",
      "CNRUG",
      "SGSGP",
      "CNJIT",
      "CNNBO",
      "SIKOP",
      "TRMER",
      "JPKAW",
      "CNSTO",
      "CNPAN",
      "ESBAR",
      "BRRDJ",
      "USOAK",
      "CNDAL",
      "CLSAN",
      "ROCON",
      "PKQAS",
      "NLROT",
      "MYPKE",
      "UAODS",
      "GRAGT",
      "AERUW",
      "CNZZU",
      "CLTAL",
      "USNYK",
      "HKHKG",
      "CNHUI",
      "AUNTL",
      "CNDSN",
      "CNMJS",
      "CNMWN",
      "BEANT",
      "USCHA",
      "KWMAA",
      "CNLYW",
      "SAYAN",
      "CNWGQ",
      "CNQUA",
      "IDBAH",
      "QARAS",
      "CNSWE",
      "JPNAG",
      "MYPAG",
      "UYULA",
      "TWMAI",
      "GBSOU",
      "UYMON",
      "JOAQA",
      "COBUE",
      "JPKMA",
      "AEABU",
      "CNZHA",
      "ZARIB",
      "SADMA",
      "BRPAR",
      "JPFUK",
      "KRYOS",
      "CNFAN",
      "BRTUB",
      "CNFUN",
      "KRPOH",
      "ZACPT",
      "BHBAH",
      "FRLEH",
      "USLSA",
      "KRINC",
      "QAUMS",
      "CNBYQ",
      "JPSKI",
      "CNRIZ",
      "CNCGM",
      "PKKAR",
      "VNHPG",
      "CNJIA",
      "GRELE",
      "ARBNA",
      "PECAL",
      "CNYZH"
    ],
    "OFFFRKRKK": [
      "CNHUA",
      "CNCJK",
      "TRYAR",
      "ECGYL",
      "CNJIJ",
      "JPYOK",
      "CNCFD",
      "CNTAI",
      "BEZEE",
      "GTPQL",
      "AUGLE",
      "CNLKU",
      "CNYTN",
      "JPOSK",
      "CNZHE",
      "RUULG",
      "KEMOM",
      "AUBRI",
      "INVIS",
      "MYPGG",
      "MY3182",
      "CNJIN",
      "TWTAP",
      "EGALE",
      "BRRGR",
      "AEJAL",
      "CNDDG",
      "CNNTG",
      "THKSI",
      "CNSHE",
      "AUESP",
      "CNDJK",
      "AEFUJ",
      "CNQHD",
      "ITGOA",
      "TRALI",
      "JPKIS",
      "INKNP",
      "JPCBA",
      "CNWEN",
      "ESGIJ",
      "CNYPG",
      "EGPSA",
      "VNSOD",
      "MTMAL",
      "KRBUS",
      "EGDAM",
      "CNSLH",
      "VNCAM",
      "CNLSN",
      "THLCB",
      "IDSAM",
      "CNGUA",
      "CN9862",
      "BRITA",
      "USSAV",
      "MXLCS",
      "CNTJN",
      "CNMEZ",
      "BRSTS",
      "CNNSA",
      "JPOIT",
      "KRGWA",
      "CAVCR",
      "OMSOH",
      "PABAL",
      "CNYAN",
      "AUMEL",
      "CNZJG",
      "CNLYG",
      "KRDAN",
      "AUGER",
      "CNTAZ",
      "SAJUB",
      "BRPDM",
      "CNZOS",
      "SAJED",
      "CNYSN",
      "AUHAY",
      "NLAMS",
      "KRULS",
      "MXMAN",
      "CNQIN",
      "CNXIA",
      "USNPN",
      "ESCAR",
      "PLGDA",
      "TWKAO",
      "CNLAZ",
      "CNCHS",
      "MYTPP",
      "CNBAO",
      "RUNJK",
      "CNGLA",
      "INMUN",
      "CNQIZ",
      "CNSDG",
      "MY2243",
      "INCHN",
      "BRPEC",
      "KRPYT",
      "DEHAM",
      "CNBHI",
      "CNWEI",
      "MYTBS",
      "CNPYU",
      "JPMIZ",
      "CNRUG",
      "SGSGP",
      "CNJIT",
      "CNNBO",
      "SIKOP",
      "TRMER",
      "JPKAW",
      "CNSTO",
      "CNPAN",
      "ESBAR",
      "BRRDJ",
      "USOAK",
      "CNDAL",
      "ROCON",
      "PKQAS",
      "NLROT",
      "MYPKE",
      "GRAGT",
      "AERUW",
      "CNZZU",
      "CLTAL",
      "USNYK",
      "HKHKG",
      "CNHUI",
      "AUNTL",
      "CNDSN",
      "CNDCB",
      "CNMWN",
      "BEANT",
      "USCHA",
      "KWMAA",
      "CNLYW",
      "SAYAN",
      "CNWGQ",
      "CN9873",
      "CNQUA",
      "IDBAH",
      "CNNJG",
      "JPNAG",
      "MYPAG",
      "UYULA",
      "TWMAI",
      "GBSOU",
      "UYMON",
      "JOAQA",
      "AUADE",
      "COBUE",
      "JPKMA",
      "AEABU",
      "CNZHA",
      "CN1087",
      "ZARIB",
      "SADMA",
      "BRPAR",
      "JPFUK",
      "KRYOS",
      "CNFAN",
      "AUFRE",
      "BRTUB",
      "CNFUN",
      "KRPOH",
      "ZACPT",
      "BHBAH",
      "FRLEH",
      "USLSA",
      "KRINC",
      "QAUMS",
      "CNBYQ",
      "JPSKI",
      "CNRIZ",
      "CNCGM",
      "PKKAR",
      "VNHPG",
      "CNJIA",
      "GRELE",
      "PECAL",
      "CNYZH"
    ],
    "OFFKFSNKK": [
      "CNHUA",
      "CNCJK",
      "TRYAR",
      "ECGYL",
      "CNJIJ",
      "JPYOK",
      "CNCFD",
      "CNTAI",
      "BEZEE",
      "GTPQL",
      "AUGLE",
      "CNLKU",
      "CNYTN",
      "JPOSK",
      "CNZHE",
      "RUULG",
      "KEMOM",
      "AUBRI",
      "INVIS",
      "MYPGG",
      "MY3182",
      "CNJIN",
      "TWTAP",
      "EGALE",
      "BRRGR",
      "AEJAL",
      "CNDDG",
      "CNNTG",
      "THKSI",
      "CNSHE",
      "AUESP",
      "CNDJK",
      "AEFUJ",
      "CNQHD",
      "ITGOA",
      "TRALI",
      "JPKIS",
      "INKNP",
      "JPCBA",
      "CNWEN",
      "ESGIJ",
      "CNYPG",
      "EGPSA",
      "VNSOD",
      "MTMAL",
      "KRBUS",
      "EGDAM",
      "CNSLH",
      "VNCAM",
      "CNLSN",
      "THLCB",
      "IDSAM",
      "CNGUA",
      "CN9862",
      "BRITA",
      "USSAV",
      "MXLCS",
      "CNTJN",
      "CNMEZ",
      "BRSTS",
      "CNNSA",
      "JPOIT",
      "KRGWA",
      "CAVCR",
      "OMSOH",
      "PABAL",
      "CNYAN",
      "AUMEL",
      "CNZJG",
      "CNLYG",
      "KRDAN",
      "AUGER",
      "CNTAZ",
      "SAJUB",
      "BRPDM",
      "CNZOS",
      "SAJED",
      "CNYSN",
      "AUHAY",
      "NLAMS",
      "KRULS",
      "MXMAN",
      "CNQIN",
      "CNXIA",
      "USNPN",
      "ESCAR",
      "PLGDA",
      "TWKAO",
      "CNLAZ",
      "CNCHS",
      "MYTPP",
      "CNBAO",
      "RUNJK",
      "CNGLA",
      "INMUN",
      "CNQIZ",
      "CNSDG",
      "MY2243",
      "INCHN",
      "BRPEC",
      "KRPYT",
      "DEHAM",
      "CNBHI",
      "CNWEI",
      "MYTBS",
      "CNPYU",
      "JPMIZ",
      "CNRUG",
      "SGSGP",
      "CNJIT",
      "CNNBO",
      "SIKOP",
      "TRMER",
      "JPKAW",
      "CNSTO",
      "CNPAN",
      "ESBAR",
      "BRRDJ",
      "USOAK",
      "CNDAL",
      "ROCON",
      "PKQAS",
      "NLROT",
      "MYPKE",
      "GRAGT",
      "AERUW",
      "CNZZU",
      "CLTAL",
      "USNYK",
      "HKHKG",
      "CNHUI",
      "AUNTL",
      "CNDSN",
      "CNDCB",
      "CNMWN",
      "BEANT",
      "USCHA",
      "KWMAA",
      "CNLYW",
      "SAYAN",
      "CNWGQ",
      "CN9873",
      "CNQUA",
      "IDBAH",
      "CNNJG",
      "JPNAG",
      "MYPAG",
      "UYULA",
      "TWMAI",
      "GBSOU",
      "UYMON",
      "JOAQA",
      "AUADE",
      "COBUE",
      "JPKMA",
      "AEABU",
      "CNZHA",
      "CN1087",
      "ZARIB",
      "SADMA",
      "BRPAR",
      "JPFUK",
      "KRYOS",
      "CNFAN",
      "AUFRE",
      "BRTUB",
      "CNFUN",
      "KRPOH",
      "ZACPT",
      "BHBAH",
      "FRLEH",
      "USLSA",
      "KRINC",
      "QAUMS",
      "CNBYQ",
      "JPSKI",
      "CNRIZ",
      "CNCGM",
      "PKKAR",
      "VNHPG",
      "CNJIA",
      "GRELE",
      "PECAL",
      "CNYZH"
    ],
    "OARKFFKKK": [
      "CNHUA",
      "CNCJK",
      "TRYAR",
      "ECGYL",
      "CNJIJ",
      "JPYOK",
      "CNCFD",
      "CNTAI",
      "BEZEE",
      "GTPQL",
      "AUGLE",
      "CNLKU",
      "CNYTN",
      "JPOSK",
      "CNZHE",
      "RUULG",
      "KEMOM",
      "AUBRI",
      "INVIS",
      "MYPGG",
      "MY3182",
      "CNJIN",
      "TWTAP",
      "EGALE",
      "BRRGR",
      "AEJAL",
      "CNDDG",
      "CNNTG",
      "THKSI",
      "CNSHE",
      "AUESP",
      "CNDJK",
      "AEFUJ",
      "CNQHD",
      "ITGOA",
      "TRALI",
      "JPKIS",
      "INKNP",
      "JPCBA",
      "CNWEN",
      "ESGIJ",
      "CNYPG",
      "EGPSA",
      "VNSOD",
      "MTMAL",
      "KRBUS",
      "EGDAM",
      "CNSLH",
      "VNCAM",
      "CNLSN",
      "THLCB",
      "IDSAM",
      "CNGUA",
      "CN9862",
      "BRITA",
      "USSAV",
      "MXLCS",
      "CNTJN",
      "CNMEZ",
      "BRSTS",
      "CNNSA",
      "JPOIT",
      "KRGWA",
      "CAVCR",
      "OMSOH",
      "PABAL",
      "CNYAN",
      "AUMEL",
      "CNZJG",
      "CNLYG",
      "KRDAN",
      "AUGER",
      "CNTAZ",
      "SAJUB",
      "BRPDM",
      "CNZOS",
      "SAJED",
      "CNYSN",
      "AUHAY",
      "NLAMS",
      "KRULS",
      "MXMAN",
      "CNQIN",
      "CNXIA",
      "USNPN",
      "ESCAR",
      "PLGDA",
      "TWKAO",
      "CNLAZ",
      "CNCHS",
      "MYTPP",
      "CNBAO",
      "RUNJK",
      "CNGLA",
      "INMUN",
      "CNQIZ",
      "CNSDG",
      "MY2243",
      "INCHN",
      "BRPEC",
      "KRPYT",
      "DEHAM",
      "CNBHI",
      "CNWEI",
      "MYTBS",
      "CNPYU",
      "JPMIZ",
      "CNRUG",
      "SGSGP",
      "CNJIT",
      "CNNBO",
      "SIKOP",
      "CNCHZ",
      "TRMER",
      "JPKAW",
      "CNSTO",
      "CNPAN",
      "ESBAR",
      "BRRDJ",
      "USOAK",
      "CNDAL",
      "ROCON",
      "PKQAS",
      "NLROT",
      "MYPKE",
      "GRAGT",
      "AERUW",
      "CNZZU",
      "CLTAL",
      "USNYK",
      "HKHKG",
      "CNHUI",
      "AUNTL",
      "CNDSN",
      "CNDCB",
      "CNMJS",
      "CNMWN",
      "BEANT",
      "CNLYW",
      "KWMAA",
      "SAYAN",
      "CNWGQ",
      "CN9873",
      "CNQUA",
      "IDBAH",
      "CNNJG",
      "CNSWE",
      "JPNAG",
      "MYPAG",
      "UYULA",
      "TWMAI",
      "GBSOU",
      "UYMON",
      "JOAQA",
      "AUADE",
      "COBUE",
      "JPKMA",
      "AEABU",
      "CNZHA",
      "CN1087",
      "ZARIB",
      "SADMA",
      "BRPAR",
      "JPFUK",
      "KRYOS",
      "CNFAN",
      "AUFRE",
      "BRTUB",
      "CNFUN",
      "KRPOH",
      "ZACPT",
      "BHBAH",
      "FRLEH",
      "USLSA",
      "KRINC",
      "QAUMS",
      "CNBYQ",
      "JPSKI",
      "CNRIZ",
      "CNCGM",
      "PKKAR",
      "VNHPG",
      "CNJIA",
      "GRELE",
      "PECAL",
      "CNYZH"
    ],
    "OFFNYNNKK": [
      "CNQIZ",
      "CNSLH",
      "CNLSN",
      "CNSDG",
      "QAASN",
      "SAJUT",
      "CNCFD",
      "CNZHA",
      "JPKII",
      "SGSGP",
      "CNTJN",
      "CNNBO",
      "CNMEZ",
      "KRGWA",
      "CNYAN",
      "CNDAL",
      "CNJIN",
      "OMMAF",
      "KRINC",
      "BRPDM",
      "AERUW",
      "CNZOS",
      "IQMAB",
      "CNDJK",
      "CNHUI",
      "JPSKI",
      "SARTA",
      "AEFUJ",
      "KRULS",
      "KWMAA",
      "JPCBA",
      "CNQIN",
      "CNYPG",
      "TWKAO"
    ],
    "OFFAGCAKK": [
      "CNHUA",
      "CNCJK",
      "TRYAR",
      "ECGYL",
      "CNJIJ",
      "JPYOK",
      "CNCFD",
      "CNTAI",
      "BEZEE",
      "GTPQL",
      "AUGLE",
      "CNLKU",
      "CNYTN",
      "JPOSK",
      "CNZHE",
      "RUULG",
      "KEMOM",
      "AUBRI",
      "INVIS",
      "MYPGG",
      "MY3182",
      "CNJIN",
      "TWTAP",
      "EGALE",
      "BRRGR",
      "AEJAL",
      "CNDDG",
      "CNNTG",
      "THKSI",
      "CNSHE",
      "AUESP",
      "CNDJK",
      "AEFUJ",
      "CNQHD",
      "ITGOA",
      "TRALI",
      "JPKIS",
      "INKNP",
      "JPCBA",
      "CNWEN",
      "ESGIJ",
      "CNYPG",
      "EGPSA",
      "VNSOD",
      "MTMAL",
      "KRBUS",
      "EGDAM",
      "CNSLH",
      "VNCAM",
      "CNLSN",
      "THLCB",
      "IDSAM",
      "CNGUA",
      "CN9862",
      "BRITA",
      "USSAV",
      "MXLCS",
      "CNTJN",
      "CNMEZ",
      "BRSTS",
      "CNNSA",
      "JPOIT",
      "KRGWA",
      "CAVCR",
      "OMSOH",
      "PABAL",
      "CNYAN",
      "AUMEL",
      "CNZJG",
      "CNLYG",
      "KRDAN",
      "AUGER",
      "CNTAZ",
      "SAJUB",
      "BRPDM",
      "CNZOS",
      "SAJED",
      "CNYSN",
      "AUHAY",
      "NLAMS",
      "KRULS",
      "MXMAN",
      "CNQIN",
      "CNXIA",
      "USNPN",
      "ESCAR",
      "PLGDA",
      "TWKAO",
      "CNLAZ",
      "CNCHS",
      "MYTPP",
      "CNBAO",
      "RUNJK",
      "CNGLA",
      "INMUN",
      "CNQIZ",
      "CNSDG",
      "MY2243",
      "INCHN",
      "BRPEC",
      "KRPYT",
      "DEHAM",
      "CNBHI",
      "CNWEI",
      "MYTBS",
      "CNPYU",
      "JPMIZ",
      "CNRUG",
      "SGSGP",
      "CNJIT",
      "CNNBO",
      "SIKOP",
      "TRMER",
      "JPKAW",
      "CNSTO",
      "CNPAN",
      "ESBAR",
      "BRRDJ",
      "USOAK",
      "CNDAL",
      "ROCON",
      "PKQAS",
      "NLROT",
      "MYPKE",
      "GRAGT",
      "AERUW",
      "CNZZU",
      "CLTAL",
      "USNYK",
      "HKHKG",
      "CNHUI",
      "AUNTL",
      "CNDSN",
      "CNDCB",
      "CNMWN",
      "BEANT",
      "USCHA",
      "KWMAA",
      "CNLYW",
      "SAYAN",
      "CNWGQ",
      "CN9873",
      "CNQUA",
      "IDBAH",
      "CNNJG",
      "JPNAG",
      "MYPAG",
      "UYULA",
      "TWMAI",
      "GBSOU",
      "UYMON",
      "JOAQA",
      "AUADE",
      "COBUE",
      "JPKMA",
      "AEABU",
      "CNZHA",
      "CN1087",
      "ZARIB",
      "SADMA",
      "BRPAR",
      "JPFUK",
      "KRYOS",
      "CNFAN",
      "AUFRE",
      "BRTUB",
      "CNFUN",
      "KRPOH",
      "ZACPT",
      "BHBAH",
      "FRLEH",
      "USLSA",
      "KRINC",
      "QAUMS",
      "CNBYQ",
      "JPSKI",
      "CNRIZ",
      "CNCGM",
      "PKKAR",
      "VNHPG",
      "CNJIA",
      "GRELE",
      "PECAL",
      "CNYZH"
    ],
    "OACFARKKK": [
      "CLLIR",
      "CNHUA",
      "CNCJK",
      "TRYAR",
      "JPYOK",
      "CNCFD",
      "CNTAI",
      "BEZEE",
      "AUGLE",
      "CNYTN",
      "AEKHA",
      "CNZHE",
      "MY3182",
      "CNJIN",
      "TWTAP",
      "EGALE",
      "BRRGR",
      "AEJAL",
      "CNDDG",
      "CNSHE",
      "AUESP",
      "CNDJK",
      "AEFUJ",
